# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!
  
#### Import all the necessary libraries here:

In [1]:
# Libraries
import pandas as pd
import numpy as np

# Challenge 1

#### Read the `employees` dataset from Ironhack's database:
* db: `employees`
* table: `employees`

Save your data in a variable called `employees`.

In [39]:
# your code here
employees = pd.read_csv("./Employee.csv")
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean `Salary` by `Department`?
**Tip**: There are 2 ways to do it: with or without pivot tables. Do it both ways.

In [40]:
# Method 1
employees.pivot_table(index=["Department"],values=["Salary"],aggfunc=np.mean)

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

In [4]:
# Method 2
employees.groupby(["Department"])["Salary"].agg("mean")

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

#### Now, group the data by more than one column. Use Pandas pivot table function to select the mean `Salary` by `Department` and `Title`.

In [5]:
employees.pivot_table(index=["Department"],columns=["Title"],values=["Salary"],aggfunc=np.mean)

           Salary
Title          VP analyst associate
Department
HR           70.0    32.5       NaN
IT           70.0    32.5      60.0
Sales         NaN     NaN      55.0

#### Display the number of `Years` of work experience and the `Salary` for each `Title`. Add `Years` as a column in your pivot table.
**Hint**: Use Pandas documentation to explore the [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) function.

In [6]:
employees.pivot_table(index=["Title"],columns=["Years"],values=["Salary"])

          Salary
Years          1     2     3     4     7     8
Title
VP           NaN   NaN   NaN   NaN   NaN  70.0
analyst     35.0  30.0   NaN  35.0   NaN   NaN
associate    NaN  55.0  55.0   NaN  60.0   NaN

#### Find the mean `Salary` and number of employees in each `Department` and for each job `Title`.

In [7]:
employees.pivot_table(index=["Department"],columns=["Title"],values=["Salary"],
                      aggfunc=[np.mean,"count"])

             mean                    count
           Salary                   Salary
Title          VP analyst associate     VP analyst associate
Department
HR           70.0    32.5       NaN    1.0     2.0       NaN
IT           70.0    32.5      60.0    1.0     2.0       1.0
Sales         NaN     NaN      55.0    NaN     NaN       2.0

#### For each `Department` and each job `Title`, find the `Salary` median, minimum, maximum and standard deviation. Comment your results.

In [42]:
employees.pivot_table(index=["Department"],columns=["Title"],values=["Salary"],
                      aggfunc=[np.median,np.min,np.max,np.std])

           median                     amin                     amax          \
           Salary                   Salary                   Salary
Title          VP analyst associate     VP analyst associate     VP analyst
Department
HR           70.0    32.5       NaN   70.0    30.0       NaN   70.0    35.0
IT           70.0    32.5      60.0   70.0    30.0      60.0   70.0    35.0
Sales         NaN     NaN      55.0    NaN     NaN      55.0    NaN     NaN

                           std
                        Salary
Title      associate   analyst associate
Department
HR               NaN  3.535534       NaN
IT              60.0  3.535534       NaN
Sales           55.0       NaN       0.0

In [10]:
"""
Employees.csv
# The minimum and maximum salaries across departments are quite equal, although associates 
# have the highest minimum salary in the IT department. However, associates have the lowest
# maximum salary in the IT department. Associates in Sales have a higher maximum salary.

Employee.csv
There seem to be many NaN values. Also

"""

'\n\nThe minimum and maximum salaries across departments are quite equal, although associates \nhave the highest minimum salary in the IT department. However, associates have the lowest\nmaximum salary in the IT department. Associates in Sales have a higher maximum salary.\n\n'

#### Based on your comments, fill the missing values with an appropriate value.

In [11]:
employees.pivot_table(index=["Department"],columns=["Title"],values=["Salary"],
                      fill_value = 0,
                      aggfunc=[np.median,np.min,np.max,np.std])

           median                     amin                     amax          \
           Salary                   Salary                   Salary
Title          VP analyst associate     VP analyst associate     VP analyst
Department
HR             70    32.5         0     70      30         0     70      35
IT             70    32.5        60     70      30        60     70      35
Sales           0     0.0        55      0       0        55      0       0

                           std
                        Salary
Title      associate   analyst associate
Department
HR                 0  3.535534         0
IT                60  3.535534         0
Sales             55  0.000000         0

#### The stake holders want to know, for each `Department`, the number of employees and how much money is spent on salaries. Could you provide that information?

In [12]:
employees.pivot_table(index=["Department"],values=["Salary"],
                      aggfunc=["count",np.median])

            count median
           Salary Salary
Department
HR              3   35.0
IT              4   47.5
Sales           2   55.0

#### For each `Department` and `Title`, find the the total years of work experience and the mean `Salary`.

In [47]:
employees.pivot_table(index=["Department"],columns=["Title"],values=["Salary","Years"],
                      fill_value = 0,aggfunc= {"Years" : "count","Salary" : np.mean})

           Salary                   Years
Title          VP analyst associate    VP analyst associate
Department
HR             70    32.5         0     1       2         0
IT             70    32.5        60     1       2         1
Sales           0     0.0        55     0       0         2

## Bonus Challenge 1

#### Compute the mean `Salary` after removing the maximum `Salary` for each `Department`. Create the appropriate pivot table.
**Hint**: Write a custom function.

In [14]:
# your code here

# Challenge 2

#### Read the `fitbit` dataset from Ironhack's database:
* db: `fitbit`
* table: `fitbit`

Save your data in a variable called `fitbit`.

In [15]:
# your code here

#### Explore you dataset in terms of data types and descriptive statistics.
**Hint**: Use Pandas functions from previous lectures.

In [16]:
# your code here

#### You suspect that there must be a linear relationship between the `Minutes Very Active` and the `Steps`. Compute the correlation between these variables.

In [17]:
# your code here

#### Use matplotlib to visually plot `Minutes Very active` vs `Steps`. We'll work with matplotlib next week. As a first introduction, uncomment and complete the following code. You need to replace the # symbol for the correct function arguments.

In [18]:
import matplotlib.pyplot as plt;

In [19]:
"""
plt.scatter(#, #)
plt.title(#)
plt.xlabel(#)
plt.ylabel(#)
plt.show()
"""

'\nplt.scatter(#, #)\nplt.title(#)\nplt.xlabel(#)\nplt.ylabel(#)\nplt.show()\n'

#### What can you say about `Minutes Very Active` and `Steps`? Write a comment below.

In [20]:
"""
your commments here
"""

'\nyour commments here\n'

#### We also suspect that there must be a linear relationship between the `Minutes Sedentary` and the `Steps`. Compute the correlation between these variables.

In [21]:
# your code here

#### Use matplotlib to visually plot `Minutes Sedentary` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [22]:
# your code here

In [23]:
"""
your commments here
"""

'\nyour commments here\n'

#### We also suspect that there must be a linear relationship between the `MinutesOfSleep` and the `Steps`. Compute the correlation between these variables.

In [24]:
# your code here

#### Use matplotlib to visually plot `MinutesOfSleep` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [25]:
# your code here

In [26]:
"""
your commments here
"""

'\nyour commments here\n'

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`.

In [27]:
columns = ['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']

In [28]:
# your code here

#### Based on the result of the correlation matrix, which of the features are highly correlated with variable `Steps`?
**Hint**: sort the correlations of `Steps` vs the rest of the features in descending order. You can use Pandas `sort_values`.

In [29]:
# your code here

# Challenge 3

#### Read the `time_grades` dataset from Ironhack's database:
* db: `time_grades`
* table: `time_grades`

Save your data in a variable called `time_grades`.

In [30]:
# your code here

#### Show visually the frequency distribution of the `time_grades` dataset.

In [31]:
# your code here

#### Is there a correlation between `Study time` and `Grade`? Use both Pearson and Spearman correlations and comment your results.

In [32]:
# your code here

In [33]:
"""
your commments here
"""

'\nyour commments here\n'

#### Use matplotlib to visually plot `Study time` vs `Grade`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [34]:
# your code here

In [35]:
"""
your commments here
"""

'\nyour commments here\n'

#### Could you explain the difference between Pearson and Spearman correlations?

In [36]:
"""
your commments here
"""

'\nyour commments here\n'